; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared2 - mode
	infrared0 - mode
	thermograph1 - mode
	spectrograph3 - mode
	Star3 - direction
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 106)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared2)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 135)
	(supports instrument6 infrared0)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 spectrograph3)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 180)
	(= (data Phenomenon4 infrared2) 123)
	(= (data Star5 infrared2) 8)
	(= (data Star6 infrared2) 266)
	(= (data Planet7 infrared2) 24)
	(= (data Star8 infrared2) 123)
	(= (data Phenomenon4 infrared0) 107)
	(= (data Star5 infrared0) 118)
	(= (data Star6 infrared0) 172)
	(= (data Planet7 infrared0) 184)
	(= (data Star8 infrared0) 266)
	(= (data Phenomenon4 thermograph1) 288)
	(= (data Star5 thermograph1) 202)
	(= (data Star6 thermograph1) 22)
	(= (data Planet7 thermograph1) 86)
	(= (data Star8 thermograph1) 2)
	(= (data Phenomenon4 spectrograph3) 76)
	(= (data Star5 spectrograph3) 214)
	(= (data Star6 spectrograph3) 144)
	(= (data Planet7 spectrograph3) 268)
	(= (data Star8 spectrograph3) 213)
	(= (slew_time Star3 GroundStation0) 44.59)
	(= (slew_time GroundStation0 Star3) 44.59)
	(= (slew_time Star3 Star1) 32.42)
	(= (slew_time Star1 Star3) 32.42)
	(= (slew_time Star3 Star2) 20.46)
	(= (slew_time Star2 Star3) 20.46)
	(= (slew_time Star1 GroundStation0) 36.44)
	(= (slew_time GroundStation0 Star1) 36.44)
	(= (slew_time Star2 GroundStation0) 30)
	(= (slew_time GroundStation0 Star2) 30)
	(= (slew_time Star2 Star1) 65.7)
	(= (slew_time Star1 Star2) 65.7)
	(= (slew_time Phenomenon4 GroundStation0) 56.63)
	(= (slew_time GroundStation0 Phenomenon4) 56.63)
	(= (slew_time Phenomenon4 Star1) 3.426)
	(= (slew_time Star1 Phenomenon4) 3.426)
	(= (slew_time Phenomenon4 Star2) 48.72)
	(= (slew_time Star2 Phenomenon4) 48.72)
	(= (slew_time Phenomenon4 Star3) 83.98)
	(= (slew_time Star3 Phenomenon4) 83.98)
	(= (slew_time Star5 GroundStation0) 18.72)
	(= (slew_time GroundStation0 Star5) 18.72)
	(= (slew_time Star5 Star1) 26.32)
	(= (slew_time Star1 Star5) 26.32)
	(= (slew_time Star5 Star2) 4.752)
	(= (slew_time Star2 Star5) 4.752)
	(= (slew_time Star5 Star3) 24.18)
	(= (slew_time Star3 Star5) 24.18)
	(= (slew_time Star5 Phenomenon4) 5.205)
	(= (slew_time Phenomenon4 Star5) 5.205)
	(= (slew_time Star6 GroundStation0) 45.77)
	(= (slew_time GroundStation0 Star6) 45.77)
	(= (slew_time Star6 Star1) 33.66)
	(= (slew_time Star1 Star6) 33.66)
	(= (slew_time Star6 Star2) 30.2)
	(= (slew_time Star2 Star6) 30.2)
	(= (slew_time Star6 Star3) 12.68)
	(= (slew_time Star3 Star6) 12.68)
	(= (slew_time Star6 Phenomenon4) 75.33)
	(= (slew_time Phenomenon4 Star6) 75.33)
	(= (slew_time Star6 Star5) 17.6)
	(= (slew_time Star5 Star6) 17.6)
	(= (slew_time Planet7 GroundStation0) 62.74)
	(= (slew_time GroundStation0 Planet7) 62.74)
	(= (slew_time Planet7 Star1) 25.03)
	(= (slew_time Star1 Planet7) 25.03)
	(= (slew_time Planet7 Star2) 2.804)
	(= (slew_time Star2 Planet7) 2.804)
	(= (slew_time Planet7 Star3) 38.51)
	(= (slew_time Star3 Planet7) 38.51)
	(= (slew_time Planet7 Phenomenon4) 61.15)
	(= (slew_time Phenomenon4 Planet7) 61.15)
	(= (slew_time Planet7 Star5) 56.23)
	(= (slew_time Star5 Planet7) 56.23)
	(= (slew_time Planet7 Star6) 24.96)
	(= (slew_time Star6 Planet7) 24.96)
	(= (slew_time Star8 GroundStation0) 60.9)
	(= (slew_time GroundStation0 Star8) 60.9)
	(= (slew_time Star8 Star1) 16)
	(= (slew_time Star1 Star8) 16)
	(= (slew_time Star8 Star2) 48)
	(= (slew_time Star2 Star8) 48)
	(= (slew_time Star8 Star3) 6.221)
	(= (slew_time Star3 Star8) 6.221)
	(= (slew_time Star8 Phenomenon4) 39.87)
	(= (slew_time Phenomenon4 Star8) 39.87)
	(= (slew_time Star8 Star5) 38.25)
	(= (slew_time Star5 Star8) 38.25)
	(= (slew_time Star8 Star6) 30.78)
	(= (slew_time Star6 Star8) 30.78)
	(= (slew_time Star8 Planet7) 11.22)
	(= (slew_time Planet7 Star8) 11.22)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon4 infrared2)
	(have_image Star5 thermograph1)
	(have_image Star6 spectrograph3)
	(have_image Planet7 infrared2)
	(have_image Star8 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 star6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 135 to 104.8, (fuel-used) from 0 to 30.2
   goals met: 0 of 5
2. (turn_to satellite2 star1 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 180 to 114.3, (fuel-used) from 30.2 to 95.9
   goals met: 0 of 5
3. (turn_to satellite1 star3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 104.8 to 92.12, (fuel-used) from 95.9 to 108.58
   goals met: 0 of 5
4. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 5
5. (calibrate satellite2 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 5
6. (turn_to satellite2 star5 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 114.3 to 87.98, (fuel-used) from 108.58 to 134.9
   goals met: 0 of 5
7. (take_image satellite2 star5 instrument7 thermograph1)
   added: (have_image star5 thermograph1)
   changed: (data_capacity satellite2) from 1000 to 798, (data-stored) from 0 to 202
   goals met: 1 of 5
8. (turn_to satellite2 star8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 87.98 to 49.73, (fuel-used) from 134.9 to 173.15
   goals met: 1 of 5
9. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 5
10. (calibrate satellite1 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 1 of 5
11. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 92.12 to 79.44, (fuel-used) from 173.15 to 185.83
   goals met: 1 of 5
12. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 106 to 101.248, (fuel-used) from 185.83 to 190.582
   goals met: 1 of 5
13. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 101.248 to 96.496, (fuel-used) from 190.582 to 195.334
   goals met: 1 of 5
14. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 96.496 to 91.744, (fuel-used) from 195.334 to 200.086
   goals met: 1 of 5
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 5
16. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 91.744 to 86.992, (fuel-used) from 200.086 to 204.838
   goals met: 1 of 5
17. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 1 of 5
18. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 86.992 to 82.24, (fuel-used) from 204.838 to 209.59
   goals met: 1 of 5
19. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 82.24 to 26.01, (fuel-used) from 209.59 to 265.82
   goals met: 1 of 5
20. (take_image satellite0 planet7 instrument2 infrared2)
   added: (have_image planet7 infrared2)
   changed: (data_capacity satellite0) from 1000 to 976, (data-stored) from 202 to 226
   goals met: 2 of 5
21. (turn_to satellite0 star2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 26.01 to 23.206, (fuel-used) from 265.82 to 268.624
   goals met: 2 of 5
22. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 23.206 to 18.454, (fuel-used) from 268.624 to 273.376
   goals met: 2 of 5
23. (turn_to satellite0 phenomenon4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 18.454 to 13.249, (fuel-used) from 273.376 to 278.581
   goals met: 2 of 5
24. (take_image satellite0 phenomenon4 instrument2 infrared2)
   added: (have_image phenomenon4 infrared2)
   changed: (data_capacity satellite0) from 976 to 853, (data-stored) from 226 to 349
   goals met: 3 of 5
25. (take_image satellite1 star6 instrument4 spectrograph3)
   added: (have_image star6 spectrograph3)
   changed: (data_capacity satellite1) from 1000 to 856, (data-stored) from 349 to 493
   goals met: 4 of 5
26. (take_image satellite2 star8 instrument7 thermograph1)
   added: (have_image star8 thermograph1)
   changed: (data_capacity satellite2) from 798 to 796, (data-stored) from 493 to 495
   goals met: 5 of 5
